/* .----------------.  .----------------.  .----------------.  .----------------.  .----------------.  .----------------.  .----------------.  .----------------.  .----------------. 
| .--------------. || .--------------. || .--------------. || .--------------. || .--------------. || .--------------. || .--------------. || .--------------. || .--------------. |
| |   ______     | || |      __      | || |   _____      | || |     ____     | || |     ______   | || |  ____  ____  | || |              | || | ____    ____ | || |  ________    | |
| |  |_   _ \    | || |     /  \     | || |  |_   _|     | || |   .'    `.   | || |   .' ___  |  | || | |_   ||   _| | || |              | || ||_   \  /   _|| || | |_   ___ `.  | |
| |    | |_) |   | || |    / /\ \    | || |    | |       | || |  /  .--.  \  | || |  / .'   \_|  | || |   | |__| |   | || |    ______    | || |  |   \/   |  | || |   | |   `. \ | |
| |    |  __'.   | || |   / ____ \   | || |    | |   _   | || |  | |    | |  | || |  | |         | || |   |  __  |   | || |   |______|   | || |  | |\  /| |  | || |   | |    | | | |
| |   _| |__) |  | || | _/ /    \ \_ | || |   _| |__/ |  | || |  \  `--'  /  | || |  \ `.___.'\  | || |  _| |  | |_  | || |              | || | _| |_\/_| |_ | || |  _| |___.' / | |
| |  |_______/   | || ||____|  |____|| || |  |________|  | || |   `.____.'   | || |   `._____.'  | || | |____||____| | || |              | || ||_____||_____|| || | |________.'  | |
| |              | || |              | || |              | || |              | || |              | || |              | || |              | || |              | || |              | |
| '--------------' || '--------------' || '--------------' || '--------------' || '--------------' || '--------------' || '--------------' || '--------------' || '--------------' |
 '----------------'  '----------------'  '----------------'  '----------------'  '----------------'  '----------------'  '----------------'  '----------------'  '----------------' 
*/




const config = require('../config')
const {cmd , commands} = require('../command')
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')
const prefix = config.PREFIX
cmd({

    pattern: "menu",

    react: "🛸",

    alias: ["panel","commands"],

    desc: "Get bot\'s command list.",

    category: "main",

    use: '.menu',

    filename: __filename

},

async(conn, mek, m,{from, l, quoted, body, isCmd, umarmd, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {

try{
let madeMenu = `*╭┈───────────────•*
*⇆ HELLO ⇆*
     *${pushname}*
*⇆ THIS IS MY COMMANDS MENU ⇆*
*╰┈───────────────•*
*ᴄʀᴇᴀᴛᴇᴅ ʙʏ BANDAHEALI*

*◆─〈 ${config.BOT_NAME} 〉─◆*
*╭┈───────────────•* 
*│  ◦*  *ʀᴜɴᴛɪᴍᴇ* : ${runtime(process.uptime())}
*│  ◦*  *ᴍᴏᴅᴇ* : *[${config.MODE}]*
*│  ◦*  *ᴘʀᴇғɪx* : *[${config.PREFIX}]*
*│  ◦*  *ɴᴀᴍᴇ ʙᴏᴛ* : *❖BALOCH-MD❖*
*│  ◦*  *ᴄʀᴇᴀᴛᴏʀ* : *➺𝘽𝙖𝙣𝙙𝙖𝙝𝙚𝙖𝙡𝙞࿐*
*│  ◦*  *ᴠᴇʀsɪᴏɴ* : *ᴠ.1.0.0*
*│  ◦*  *ᴍᴇɴᴜ ᴄᴍᴅ* : *ᴍᴇɴᴜ ʟɪsᴛ*
*╰┈───────────────•*
*♡︎•━━━━━━☻︎━━━━━━•♡︎*

*♡︎•━━━━━━☻︎━━━━━━•♡︎*
*[ • 🤴 OWNER-CMD 🤴 ‎• ]*
*╭┈───────────────•*
*┋*👑 *${prefix}ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*
*┋*👑 *${prefix}sᴇᴛᴛɪɴɢs*
*┋*👑 *${prefix}ᴏᴡɴᴇʀ*
*┋*👑 *${prefix}ʀᴇᴘᴏ*
*┋*👑 *${prefix}ꜱʏꜱᴛᴇᴍ*
*┋*👑 *${prefix}ꜱᴛᴀᴛᴜꜱ*
*┋*👑 *${prefix}ʙʟᴏᴄᴋ*
*┋*👑 *${prefix}ᴜɴʙʟᴏᴄᴋ*
*┋*👑 *${prefix}sʜᴜᴛᴅᴏᴡɴ*
*┋*👑 *${prefix}ᴄʟᴇᴀʀᴄʜᴀᴛs*
*┋*👑 *${prefix}sᴇᴛᴘᴘ*
*┋*👑 *${prefix}ʙʀᴏᴀᴅᴄᴀsᴛ*
*┋*👑 *${prefix}ᴊɪᴅ*
*┋*👑 *${prefix}ɢᴊɪᴅ*
*┋*👑 *${prefix}ʀᴇꜱᴛᴀʀᴛ*
*┋*👑 *${prefix}getvar* <allvars>
*┋*👑 *${prefix}setvar <true/false>*
*╰┈───────────────•*
*[ • 🔎 SEARCH-CMD 🔍 ‎• ]*
*╭┈───────────────•*
*┋*🔍 *${prefix}ʏᴛꜱ  <ᴛᴇxᴛ>*
*┋*🔍 *${prefix}ʏᴛᴀ <ᴜʀʟ>*
*┋*🔍 *${prefix}ʟᴏʟɪ <ᴛᴇxᴛ>*
*┋*🔍 *${prefix}ᴍᴏᴠɪᴇɪɴғᴏ <ᴛᴇxᴛ>*
*┋*🔍 *${prefix}ɪᴍɢ <ᴛᴇxᴛ>*
*┋*🔍 *${prefix}ᴡᴇᴀᴛʜᴇʀ <ᴄɪᴛʏ>*
*╰┈───────────────•*
*[ • 🧠 AI-CMD 🧠  ‎• ]*
*╭┈───────────────•*
*┋*🧠 *${prefix}ɢᴘᴛ <ᴛᴇxᴛ>*
*┋*🧠 *${prefix}sarkar <ᴛᴇxᴛ>*
*┋*🧠 *${prefix}ʙᴏᴛ <ᴛᴇxᴛ>*
*╰┈───────────────•*
*[ • 🚻 GROUP-CMD 🚻 ‎• ]*
*╭┈───────────────•*
*┋*⛔️ *${prefix}ᴅᴇʟᴇᴛᴇ <ʀᴇᴘʟʏ ғᴏʀ ᴅᴇʟᴇᴛᴇ sᴍs>*
*┋*🤝 *${prefix}ᴀᴅᴅ*
*┋*🦵 *${prefix}ᴋɪᴄᴋ*
*┋*👋 *${prefix}sᴇᴛɢᴏᴏᴅʙʏᴇ <ᴛᴇxᴛ>*
*┋*🤗 *${prefix}sᴇᴛᴡᴇʟᴄᴏᴍᴇ <ᴛᴇxᴛ>*
*┋*👨👑 *${prefix}ᴘʀᴏᴍᴏᴛᴇ*
*┋*👑👨 *${prefix}ᴅᴇᴍᴏᴛᴇ*
*┋*🎳 *${prefix}ᴛᴀɢᴀʟʟ*
*┋*⏬️ *${prefix}ɢᴇᴛᴘɪᴄ*
*┋*♻️ *${prefix}ɪɴᴠɪᴛᴇ*
*┋*❓️ *${prefix}ʀᴇᴠᴏᴋᴇ*
*┋*✅️ *${prefix}ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*
*┋*🔱 *${prefix}ᴀʟʟʀᴇǫ*
*┋*🔇 *${prefix}ᴍᴜᴛᴇ*
*┋*🔊 *${prefix}ᴜɴᴍᴜᴛᴇ*
*┋*🔒 *${prefix}ʟᴏᴄᴋɢᴄ*
*┋*🔓 *${prefix}ᴜɴʟᴏᴄᴋɢᴄ*
*┋*😞 *${prefix}ʟᴇᴀᴠᴇ*
*┋*🏷 *${prefix}ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ*
*┋*♻️ *${prefix}ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ*
*┋*🫂 *${prefix}ᴊᴏɪɴ*
*┋*👣 *${prefix}ʜɪᴅᴇᴛᴀɢ*
*┋*ℹ️ *${prefix}ɢɪɴғᴏ*
*┋*🕛 *${prefix}ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ*
*┋*🕛 *${prefix}ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ*
*┋*🕛 *${prefix}ᴅɪsᴀᴘᴘᴇᴀʀ 7ᴅ 24ʜ 90ᴅ*
*┋*ℹ️ *${prefix}sᴇɴᴅᴅᴍ*
*╰┈───────────────•*
*[ • ⚠️ INFO-CMD ⚠️ ‎• ]*
*╭┈───────────────•*
*┋*📃 *${prefix}ᴍᴇɴᴜ*
*┋*🧠 *${prefix}ᴀʙᴏᴜᴛ*
*┋*📜 *${prefix}sᴄʀɪᴘᴛ*
*┋*📂 *${prefix}ʀᴇᴘᴏ*
*┋*🧬 *${prefix}ᴀʟɪᴠᴇ*
*┋*📃 *${prefix}ʙᴏᴛɪɴꜰᴏ*
*┋*🗿 *${prefix}ꜱᴛᴀᴛᴜꜱ*
*┋*💸 *${prefix}ꜱᴜᴘᴘᴏʀᴛ*
*┋*📍 *${prefix}ᴘɪɴɢ*
*┋*📍 *${prefix}ᴘɪɴɢ2*
*┋*🛠 *${prefix}ꜱʏꜱᴛᴇᴍ*
*╰┈───────────────•*
*[ • 📥 DOWNLOADER-CMD 📥 ‎• ]*
*╭┈───────────────•*
*┋*⏬️ *${prefix}ғʙ <ᴜʀʟ>*
*┋*⏬️ *${prefix}ɪɴꜱᴛᴀ <ᴜʀʟ>*
*┋*⏬️ *${prefix}ᴠɪᴅᴇᴏ <ᴜʀʟ>*
*┋*⏬️ *${prefix}ɢᴅʀɪᴠᴇ <ᴜʀʟ>*
*┋*⏬️ *${prefix}ᴛᴡɪᴛᴛᴇʀ <ᴜʀʟ>*
*┋*⏬️ *${prefix}ᴛᴛ<ᴜʀʟ>*
*┋*⏬️ *${prefix}ᴍᴇᴅɪᴀғɪʀᴇ <ᴜʀʟ>*
*┋*⏬️ *${prefix}ꜱᴏɴɢ <ϙᴜᴇʀʏ>*
*┋*⏬️ *${prefix}ᴘʟᴀʏ <ᴜʀʟ>*
*┋*⏬️ *${prefix}ᴠɪᴅᴇᴏ <ϙᴜᴇʀʏ>*
*┋*⏬️ *${prefix}ᴠɪᴅᴇᴏ2 <ᴜʀʟ>*
*┋*⏬️ *${prefix}ɪᴍɢ <ϙᴜᴇʀʏ>*
*┋*⏬️ *${prefix}ᴀᴘᴋ <ɴᴀᴍᴇ>*
*┋*⏬️ *${prefix}ᴅᴀʀᴀᴍᴀ <ᴛɪᴛᴛʟᴇ>*
*┋*⏬️ *${prefix}ᴘʟᴀʏ2 <ᴛɪᴛᴛʟᴇ>*
*┋*⏬️ *${prefix}ʙᴀɪsᴄᴏᴘᴇ <ᴜʀʟ>*
*┋*⏬️ *${prefix}ɢɪɴɪsɪsɪʟᴀ <ᴛɪᴛᴛʟᴇ>*
*╰┈───────────────•*
*[ • ♻️ CONVERTER-CMD ♻️ ‎• ]*
*╭┈───────────────•*
*┋*😝 *${prefix}sᴛɪᴄᴋᴇʀ*
*┋*🈯️ *${prefix}ᴛʀᴛ <ᴛᴇxᴛ>*
*┋*🔊 *${prefix}ᴛᴛs <ᴛᴇxᴛ>*
*╰┈───────────────•*
*[ • ♾️ RANDOM-CMD ♾️ ‎• ]*
*╭┈───────────────•*
*┋*👑 *${prefix}ᴋɪɴɢ*
*┋*🐶 *${prefix}ᴅᴏɢ*
*┋*💢 *${prefix}ᴀɴɪᴍᴇ*
*┋*💫 *${prefix}ᴀɴɪᴍᴇɢɪʀʟ*
*┋*💫 *${prefix}ᴀɴɪᴍᴇɢɪʀʟ1*
*┋*💫 *${prefix}ᴀɴɪᴍᴇɢɪʀʟ2*
*┋*💫 *${prefix}ᴀɴɪᴍᴇɢɪʀʟ3*
*┋*💫 *${prefix}ᴀɴɪᴍᴇɢɪʀʟ4*
*┋*💫 *${prefix}ᴀɴɪᴍᴇɢɪʀʟ5*
*╰┈───────────────•*
*[ • 🏜️ WALLPAPERS-CMD 🏜️ ‎• ]*
*╭┈───────────────•*
*┋* *${prefix}ɪᴍɢ*
*╰┈───────────────•*
*[ • 🌐 OTHER-CMD 🌐 ‎• ]*
*╭┈───────────────•*
*┋*🈯️ *${prefix}ᴛʀᴛ*
*┋*😜 *${prefix}ᴊᴏᴋᴇ*
*┋*🙃 *${prefix}ꜰᴀᴄᴛ*
*┋*ℹ️ *${prefix}ɢɪᴛʜᴜʙꜱᴛᴀʟᴋ*
*┋*🔑 *${prefix}ɢᴘᴀꜱꜱ*
*┋*👨‍💻 *${prefix}ʜᴀᴄᴋ*
*┋*⁉️ *${prefix}ǫᴜᴏᴛᴇ*
*┋*🔍 *${prefix}ꜱʀᴇᴘᴏ*
*┋*☺️ *${prefix}ᴅᴇꜰɪɴᴇ*
*╰┈───────────────•*
*❒⁠⁠⁠⁠▭▬▭▬▭▬▭▬▭▬▭▬▭❒*⁠⁠⁠⁠
━━━━━•⟢
*👇👇👇MY REPO LINK👇👇👇*
━━━━━•⟢
┏━━━━━━━━━━━━━━━━━━━◆
*https://github.com/Sarkar-Bandaheali/BALOCH-MD*
┗━━━━━━━━━━━━━━━━━━━◆

*•────────────•⟢*
> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ 𝘽𝙖𝙣𝙙𝙖𝙝𝙚𝙖𝙡𝙞
*•────────────•⟢*
`

await conn.sendMessage(from,{image:{url:`https://raw.githubusercontent.com/Sarkar-Bandaheali/BALOCH-MD_DATABASE/refs/heads/main/autovoice/file-KegkWLpfvrRHPJDpD5iTRB%20(1).webp`},caption:madeMenu},{quoted:mek});


}catch(e){
console.log(e)
reply(`${e}`)
}
})
